/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: assembler.h
**
** 创   建   人: Wang.Dongfang (王东方)
**
** 文件创建日期: 2017 年 10 月 31 日
**
** 描        述: x86 汇编相关宏定义.
*********************************************************************************************************/

#ifndef __ASMX86_ASSEMBLER_H
#define __ASMX86_ASSEMBLER_H

/*********************************************************************************************************
  x86 architecture assembly special code
*********************************************************************************************************/

#if defined(__ASSEMBLY__) || defined(ASSEMBLY)

/*********************************************************************************************************
  assembler define
*********************************************************************************************************/

#  define EXPORT_LABEL(label)       .global label
#  define IMPORT_LABEL(label)       .extern label

#  define FUNC_LABEL(func)          func:
#  define LINE_LABEL(line)          line:

#  define FUNC_DEF(func)  \
        .type   func, %function;  \
func:

#  define FUNC_END(func)    \
        .size   func, . - func

#  define FILE_BEGIN()  \
        .text

#  define FILE_END()    \
        .end
        
#  define SECTION(sec)  \
        .section sec

#endif                                                                  /*  __ASSEMBLY__                */

#endif                                                                  /*  __ASMX86_ASSEMBLER_H        */
/*********************************************************************************************************
  END
*********************************************************************************************************/
