/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: bspInit.c
**
** 创   建   人: Li.Jing (李靖)
**
** 文件创建日期: 2017 年 11 月 01 日
**
** 描        述: BSP 用户 C 程序入口.
*********************************************************************************************************/
#include <loader.h>
#include "../config.h"

/*********************************************************************************************************
  基本二进制大小单位定义
*********************************************************************************************************/
#define LW_CFG_KB_SIZE                              (1024)
#define LW_CFG_MB_SIZE                              (1024 * LW_CFG_KB_SIZE)
#define LW_CFG_GB_SIZE                              (1024 * LW_CFG_MB_SIZE)
/*********************************************************************************************************
  全局变量
*********************************************************************************************************/
static REGION  _G_rgMemory[20];
/*********************************************************************************************************
** 函数名称: bspInit
** 功能描述: C 入口
** 输　入  : NONE
** 输　出  : 0 成功，非0 失败
** 全局变量:
** 调用模块:
*********************************************************************************************************/
INT  bspInit (VOID)
{
    CPCHAR      pcBootCmdLine = BSP_CFG_DEFAULT_START_PARAM;
    UINT32      uiRegionNum   = 0;

    _G_rgMemory[uiRegionNum].RG_ulAddr  = BSP_CFG_ROM_BASE;
    _G_rgMemory[uiRegionNum].RG_stSize  = BSP_CFG_ROM_SIZE;
    _G_rgMemory[uiRegionNum].RG_uiType  = REGION_TYPE_ROM;
    uiRegionNum++;

    _G_rgMemory[uiRegionNum].RG_ulAddr  = BSP_CFG_RAM_BASE;
    _G_rgMemory[uiRegionNum].RG_stSize  = BSP_CFG_RAM_SIZE;
    _G_rgMemory[uiRegionNum].RG_uiType  = REGION_TYPE_RAM;
    uiRegionNum++;

    loaderStart(pcBootCmdLine, _G_rgMemory, uiRegionNum);               /*  加载并启动 matrix           */

    return  (0);
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
