/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                嵌入式 L4 微内核操作系统
**
**                                SylixOS(TM)  MX : matrix
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: service.h
**
** 创   建   人: Cheng.Yongbin (程永斌)
**
** 文件创建日期: 2018 年 2 月 6 日
**
** 描        述: 服务接口
*********************************************************************************************************/
#ifndef __T_SERVICE_H
#define __T_SERVICE_H
/*********************************************************************************************************
  root - service
*********************************************************************************************************/
#define T_ROOT_SER_REG          1                                       /* 注册服务     */
#define T_ROOT_SER_FIND         2                                       /* 查找服务     */
#define T_ROOT_SER_CLOSE        3                                       /* 关闭服务     */
#define T_ROOT_SER_TEST_BOOT    4                                       /* 启动单元测试 */
/*********************************************************************************************************
    root service user interface
*********************************************************************************************************/
BOOL TI_rootSerRegister(MX_OBJECT_ID objRoot, UINT32 uiSerId);

MX_OBJECT_ID TI_rootSerFind(MX_OBJECT_ID objRoot, UINT32 uiSerId);

BOOL  TI_rootSerClose(MX_OBJECT_ID objRoot);

BOOL  TI_rootSerTestBoot(MX_OBJECT_ID objRoot);
/*********************************************************************************************************
    root service kern interface
*********************************************************************************************************/
MX_OBJECT_ID TKI_rootSerFind(MX_OBJECT_ID objRoot, UINT32 uiSerId);

BOOL  TKI_rootSerClose(MX_OBJECT_ID objRoot);

#endif                                                                  /*  __T_SERVICE_H               */
/*********************************************************************************************************
  END
*********************************************************************************************************/
