/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: lib_memory.h
**
** 创   建   人: Cheng.yongbin (程永斌)
**
** 文件创建日期: 2017 年 11 月 08 日
**
** 描        述: memcpy(), memset() 函数声明.
*********************************************************************************************************/

#ifndef __LIB_MEMORY_H
#define __LIB_MEMORY_H

#include "../arch/arch_inc.h"                                           /*  体系结构相关                */

PVOID  lib_memcpy(PVOID  pvDest, CPVOID   pvSrc, size_t  stCount);
PVOID  lib_memset(PVOID  pvDest, INT  iC, size_t  stCount);

#endif                                                                  /*  __LIB_MEMORY_H              */
/*********************************************************************************************************
  END
*********************************************************************************************************/
