/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                嵌入式 L4 微内核操作系统
**
**                                SylixOS(TM)  MX : matrix
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: _BitmapLib.c
**
** 创   建   人: Wang.Dongfang (王东方)
**
** 文件创建日期: 2017 年 12 月 19 日
**
** 描        述: 位图操作库.
*********************************************************************************************************/
#include <Matrix.h>
/*********************************************************************************************************
** 函数名称: _BitmapInit
** 功能描述: 初始化位图控制块
** 输　入  : pbmap         位图控制块
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  _BitmapInit (PMX_BMAP  pbmap)
{
    INT     i;

    pbmap->BMAP_uiMap = 0;
    for (i = 0; i < sizeof(pbmap->BMAP_uiSubMap) / sizeof(UINT32); i++) {
        pbmap->BMAP_uiSubMap[i] = 0;
    }
}
/*********************************************************************************************************
** 函数名称: _BitmapAdd
** 功能描述: 添加一个标记到位图表
** 输　入  : pbmap         位图控制块
**           uiPriority    优先级(0 -- 1023)
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  _BitmapAdd (PMX_BMAP  pbmap, UINT32  uiPriority)
{
    pbmap->BMAP_uiMap |= (1 << (uiPriority >> 5));
    pbmap->BMAP_uiSubMap[uiPriority >> 5] |= (1 << (uiPriority & 0x1f));
}
/*********************************************************************************************************
** 函数名称: _BitmapDel
** 功能描述: 从位图表删除一个标记
** 输　入  : pbmap         位图控制块
**           uiPriority    优先级
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  _BitmapDel (PMX_BMAP  pbmap, UINT32  uiPriority)
{
    pbmap->BMAP_uiSubMap[uiPriority >> 5] &= ~(1 << (uiPriority & 0x1f));
    if (pbmap->BMAP_uiSubMap[uiPriority >> 5] == 0) {
        pbmap->BMAP_uiMap &= ~(1 << (uiPriority >> 5));
    }
}
/*********************************************************************************************************
** 函数名称: _BitmapHigh
** 功能描述: 获得位图表中的最高优先级
** 输　入  : pbmap         位图控制块
** 输　出  : 优先级
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
UINT32  _BitmapHigh (PMX_BMAP  pbmap)
{
    UINT32  uiHigh = (UINT32)archFindLsb((INT)pbmap->BMAP_uiMap);       /*  有置位时返回[1 - 32], 否则0 */
    UINT32  uiLow;
    
    if (uiHigh == 0) {
        return  (0);
    }
    
    uiHigh--;
    uiLow = (UINT32)archFindLsb((INT)pbmap->BMAP_uiSubMap[uiHigh]) - 1;
    
    return  ((UINT32)((uiHigh << 5) | uiLow));
}
/*********************************************************************************************************
** 函数名称: _BitmapIsEmpty
** 功能描述: 判断位图表是否为空
** 输　入  : pbmap         位图控制块
** 输　出  : 是否为空
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
BOOL  _BitmapIsEmpty (PMX_BMAP  pbmap)
{
    return  ((pbmap->BMAP_uiMap) ? MX_FALSE : MX_TRUE);
}
/*********************************************************************************************************
  END
*********************************************************************************************************/

