/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                嵌入式 L4 微内核操作系统
**
**                                SylixOS(TM)  MX : matrix
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: _RdyPrio.c
**
** 创   建   人: Wang.Dongfang (王东方)
**
** 文件创建日期: 2017 年 12 月 19 日
**
** 描        述: 优先级控制块操作.
*********************************************************************************************************/
#include <Matrix.h>
/*********************************************************************************************************
** 函数名称: _RdyPrioGet
** 功能描述: 根据 vCPU 结构体获取优先级控制块
** 输　入  : pvcpu     vCPU 控制块
** 输　出  : 先级控制块
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
PMX_RDYP  _RdyPrioGet (PMX_VCPU  pvcpu)
{
    if (pvcpu->VCPU_bCpuAffinity) {                                     /*  亲和物理 CPU                */
        return  (MX_CPU_RDY_RDYP(MX_CPU_GET(pvcpu->VCPU_ulCpuIdAffinity), pvcpu->VCPU_uiPriority));

    } else {
        return  (MX_GLOBAL_RDY_RDYP(pvcpu->VCPU_uiPriority));
    }
}
/*********************************************************************************************************
** 函数名称: _RdyPrioIsEmpty
** 功能描述: 本优先级控制块中是否没有线程
** 输　入  : prdyp     优先级控制块
** 输　出  : MX_TRUE 当环形链表空时, 否则 MX_FALSE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
BOOL  _RdyPrioIsEmpty (PMX_RDYP  prdyp)
{
    return  (prdyp->RDYP_pringReadyHeader ? MX_FALSE : MX_TRUE);
}
/*********************************************************************************************************
** 函数名称: _RdyPrioIsOne
** 功能描述: 本优先级控制块中是否只有一个线程
** 输　入  : prdyp     优先级控制块
** 输　出  : MX_TRUE 当环形链表中只有一个线程时, 否则 MX_FALSE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
BOOL  _RdyPrioIsOne (PMX_RDYP  prdyp)
{
    if (prdyp->RDYP_pringReadyHeader) {                                 /*  环形链表不为空              */
        if (prdyp->RDYP_pringReadyHeader == 
            _list_ring_get_next(prdyp->RDYP_pringReadyHeader)) {
            return  (MX_TRUE);    
        }
    }
    
    return  (MX_FALSE);
}
/*********************************************************************************************************
** 函数名称: _RdyPrioAddVcpu
** 功能描述: 将一个 vCPU 加入优先级控制块
** 输　入  : pvcpu       vCPU 控制块
**           prdyp       优先级控制块
**           bIsHeader   是否插入头部
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  _RdyPrioAddVcpu (PMX_VCPU  pvcpu, PMX_RDYP  prdyp, BOOL  bIsHeader)
{
    if (bIsHeader) {
        _List_Ring_Add_Ahead(&pvcpu->VCPU_ringReady, &prdyp->RDYP_pringReadyHeader);
    
    } else {
        _List_Ring_Add_Last(&pvcpu->VCPU_ringReady, &prdyp->RDYP_pringReadyHeader);
    }
}
/*********************************************************************************************************
** 函数名称: _RdyPrioDelVcpu
** 功能描述: 将一个 vCPU 从就绪环中解除
** 输　入  : pvcpu       vCPU 控制块
**           prdyp       优先级控制块
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  _RdyPrioDelVcpu (PMX_VCPU  pvcpu, PMX_RDYP  prdyp)
{
    _List_Ring_Del(&pvcpu->VCPU_ringReady, &prdyp->RDYP_pringReadyHeader);
}
/*********************************************************************************************************
  END
*********************************************************************************************************/

