/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: eim.h
**
** 创   建   人: Xu.GuiZhou (徐贵洲)
**
** 文件创建日期: 2016 年 09 月 13 日
**
** 描        述: EIM 外扩总线驱动
*********************************************************************************************************/
#ifndef EIM_H_
#define EIM_H_

#define EIM_MEM_BASE_ADDR       (0x08000000)
#define EIM_SPACE_SIZE          (0x1400000)

/*********************************************************************************************************
  EIM 外扩总线接口 控制器类型定义
*********************************************************************************************************/
typedef struct {
    LW_DEV_HDR                  EIM_devHdr;                             /* 必须是第一个结构体成员       */
    LW_LIST_LINE_HEADER         EIM_devHdr_fdNodeHeader;

    addr_t                      EIM_uiRegBase;
    addr_t                      EIM_uiPhyMemBase;
    addr_t                      EIM_uiMemBase;
    INT                         EIM_iMemSize;

    size_t                      EIM_szOffset;

    UINT32                      EIM_bInit;
    VOIDFUNCPTR                 EIM_vfHwInitHook;
} EIM_CTRL, *PEIM_CTRL;
/*********************************************************************************************************
  EIM 外扩总线接口 函数接口定义
*********************************************************************************************************/
INT eimInit(PEIM_CTRL pCtrl);
#endif                                                                  /* EIM_H_                       */
