/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                嵌入式 L4 微内核操作系统
**
**                                SylixOS(TM)  MX : matrix
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: api.h
**
** 创   建   人: Cheng.Yongbin (程永斌)
**
** 文件创建日期: 2018 年 2 月 1 日
**
** 描        述: 应用运行时环境抽象
*********************************************************************************************************/
#ifndef __T_CONFIG_H
#define __T_CONFIG_H

#define     T_POOL_VCPU_NUM        16
#define     T_POOL_SERVICE_NUM     16

#define     T_POOL_USE_MSG_NUM     T_POOL_VCPU_NUM                      /*  IPC_MSG 内存池大小          */
#define     T_POOL_USE_STK_NUM     T_POOL_VCPU_NUM                      /*  用户栈内存池分配最大数量    */

#define     T__USE_STK_SIZE        MX_CFG_PAGE_SIZE

#endif                                                                  /*  __T_CONFIG_H                */
/*********************************************************************************************************
  END
*********************************************************************************************************/
