/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: armGlobalTimer.h
**
** 创   建   人: Jiao.JinXing(焦进星)
**
** 文件创建日期: 2013 年 12 月 13 日
**
** 描        述: 全局定时器.
*********************************************************************************************************/
#ifndef ARMGLOBALTIMER_H_
#define ARMGLOBALTIMER_H_

/*********************************************************************************************************
** 函数名称: armGlobalTimerInit
** 功能描述: 初始化全局定时器
** 输　入  : bAutoIncrement        到期后 Comparator 是否自增
**           uiIncrementValue      Comparator 增量
**           uiPrescaler           预分频数值
**           bIrqEnable            是否使能 IRQ 中断
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  armGlobalTimerInit(BOOL    bAutoIncrement,
                         UINT32  uiIncrementValue,
                         UINT32  uiPrescaler,
                         BOOL    bIrqEnable);
/*********************************************************************************************************
** 函数名称: armGlobalTimerIntClear
** 功能描述: 清除全局定时器中断
** 输　入  : NONE
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  armGlobalTimerIntClear(VOID);
/*********************************************************************************************************
** 函数名称: armGlobalTimerStart
** 功能描述: 启动全局定时器
** 输　入  : NONE
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  armGlobalTimerStart(VOID);
/*********************************************************************************************************
** 函数名称: armGlobalTimerStop
** 功能描述: 停止全局定时器
** 输　入  : NONE
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  armGlobalTimerStop(VOID);
/*********************************************************************************************************
** 函数名称: armGlobalTimerCounterGet
** 功能描述: 获得全局定时器计数器值
** 输　入  : NONE
** 输　出  : 计数器值
** 全局变量:
** 调用模块:
*********************************************************************************************************/
UINT64  armGlobalTimerCounterGet(VOID);
/*********************************************************************************************************
** 函数名称: armGlobalTimerCounterSet
** 功能描述: 设置全局定时器计数器值
** 输　入  : ulCounter         计数器值
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  armGlobalTimerCounterSet(UINT64  ulCounter);
/*********************************************************************************************************
** 函数名称: armGlobalTimerComparatorGet
** 功能描述: 获得全局定时器比较器
** 输　入  : NONE
** 输　出  : 比较器值
** 全局变量:
** 调用模块:
*********************************************************************************************************/
UINT64  armGlobalTimerComparatorGet(VOID);
/*********************************************************************************************************
** 函数名称: armGlobalTimerComparatorSet
** 功能描述: 设置全局定时器比较器
** 输　入  : ulComparator      比较器值
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  armGlobalTimerComparatorSet(UINT64  ulComparator);

#endif                                                                  /*  ARMGLOBALTIMER_H_           */
/*********************************************************************************************************
  END
*********************************************************************************************************/
