/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                嵌入式 L4 微内核操作系统
**
**                                SylixOS(TM)  MX : matrix
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: _vIrq.c
**
** 创   建   人: Wang.Dongfang (王东方)
**
** 文件创建日期: 2018 年 03 月 30 日
**
** 描        述: 虚拟中断位操作.
*********************************************************************************************************/
#include <Matrix.h>
#define  __CHECK_NUM       8
#define  __BIT_PER_ELEM    32
/*********************************************************************************************************
** 函数名称: __FindLsb
** 功能描述: Find least significant bit set 寻找 32 位数中最低的 1 位
** 输　入  : ui32      32 位数
** 输　出  : 最低位为 1 的位置
**           正确返回 [0 ~ 31], 如果参数为全 0 则返回 -1
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static INT  __FindLsb (UINT32  ui32)
{
    static const UINT8 ucLsbBitmap[] = {
        0, 0, 1, 0, 2, 0, 1, 0, 3, 0, 1, 0, 2, 0, 1, 0, 4, 0, 1, 0, 2, 0, 1, 0, 3, 0, 1, 0, 2, 0, 1, 0,
        5, 0, 1, 0, 2, 0, 1, 0, 3, 0, 1, 0, 2, 0, 1, 0, 4, 0, 1, 0, 2, 0, 1, 0, 3, 0, 1, 0, 2, 0, 1, 0,
        6, 0, 1, 0, 2, 0, 1, 0, 3, 0, 1, 0, 2, 0, 1, 0, 4, 0, 1, 0, 2, 0, 1, 0, 3, 0, 1, 0, 2, 0, 1, 0,
        5, 0, 1, 0, 2, 0, 1, 0, 3, 0, 1, 0, 2, 0, 1, 0, 4, 0, 1, 0, 2, 0, 1, 0, 3, 0, 1, 0, 2, 0, 1, 0,
        7, 0, 1, 0, 2, 0, 1, 0, 3, 0, 1, 0, 2, 0, 1, 0, 4, 0, 1, 0, 2, 0, 1, 0, 3, 0, 1, 0, 2, 0, 1, 0,
        5, 0, 1, 0, 2, 0, 1, 0, 3, 0, 1, 0, 2, 0, 1, 0, 4, 0, 1, 0, 2, 0, 1, 0, 3, 0, 1, 0, 2, 0, 1, 0,
        6, 0, 1, 0, 2, 0, 1, 0, 3, 0, 1, 0, 2, 0, 1, 0, 4, 0, 1, 0, 2, 0, 1, 0, 3, 0, 1, 0, 2, 0, 1, 0,
        5, 0, 1, 0, 2, 0, 1, 0, 3, 0, 1, 0, 2, 0, 1, 0, 4, 0, 1, 0, 2, 0, 1, 0, 3, 0, 1, 0, 2, 0, 1, 0
    };

    UINT16  usMsw = (UINT16)(ui32 >> 16);
    UINT16  usLsw = (UINT16)(ui32 & 0xffff);
    UINT8   ucByte;

    if (ui32 == 0) {
        return (-1);
    }

    if (usLsw) {
        ucByte = (UINT8)(usLsw & 0xff);
        if (ucByte) {                                                   /*  byte is bits [0:7]          */
            return (ucLsbBitmap[ucByte]);
        
        } else {                                                        /*  byte is bits [8:15]         */
            return (ucLsbBitmap[(UINT8)(usLsw >> 8)] + 8);
        }
    
    } else {
        ucByte = (UINT8)(usMsw & 0xff);                                 /*  byte is bits [16:23]        */
        if (ucByte) {
            return (ucLsbBitmap[ucByte] + 16);
        
        } else {                                                        /*  byte is bits [24:31]        */
            return (ucLsbBitmap[(UINT8)(usMsw >> 8)] + 24);
        }
    }
}
/*********************************************************************************************************
** 函数名称: _vIrqPendIni
** 功能描述: 初始化中断 Pend 位
** 输　入  : pvcpu      线程控制块指针
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  _vIrqPendIni (PMX_VCPU  pvcpu)
{
    INT  i;

    for (i = 0; i < __CHECK_NUM; i++) {
        pvcpu->VCPU_uiIrqPend[i] = 0;
    }
}
/*********************************************************************************************************
** 函数名称: _vIrqPendSet
** 功能描述: 设置虚拟中断 Pend 位
** 输　入  : pvcpu      线程控制块指针
**           ulVec      虚拟中断号 [0 -- 255]
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  _vIrqPendSet (PMX_VCPU  pvcpu, ULONG  ulVec)
{
    INT  iIndex = ulVec / __BIT_PER_ELEM;
    INT  iBit   = ulVec % __BIT_PER_ELEM;

    pvcpu->VCPU_uiIrqPend[iIndex] |= (1UL << iBit);
}
/*********************************************************************************************************
** 函数名称: _vIrqPendClr
** 功能描述: 清除虚拟中断 Pend 位
** 输　入  : pvcpu      线程控制块指针
**           ulVec      虚拟中断号 [0 -- 255]
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  _vIrqPendClr (PMX_VCPU  pvcpu, ULONG  ulVec)
{
    INT  iIndex = ulVec / __BIT_PER_ELEM;
    INT  iBit   = ulVec % __BIT_PER_ELEM;

    pvcpu->VCPU_uiIrqPend[iIndex] &= ~(1UL << iBit);
}
/*********************************************************************************************************
** 函数名称: _vIrqPendGet
** 功能描述: 获取虚拟中断号
** 输　入  : pvcpu      线程控制块指针
**           pulVec     虚拟中断号指针
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
BOOL  _vIrqPendGet (PMX_VCPU  pvcpu, ULONG  *pulVec)
{
    INT  i;

    for (i = 0; i < __CHECK_NUM; i++) {
        if (pvcpu->VCPU_uiIrqPend[i] != 0) {
            *pulVec = (i * __BIT_PER_ELEM) + __FindLsb(pvcpu->VCPU_uiIrqPend[i]);

            return  (MX_TRUE);
        }
    }
    return  (MX_FALSE);
}
BOOL  _vIrqPending (PMX_VCPU  pvcpu)
{
    INT  i;

    for (i = 0; i < __CHECK_NUM; i++) {
        if (pvcpu->VCPU_uiIrqPend[i] != 0) {
            return  (MX_TRUE);
        }
    }
    return  (MX_FALSE);
}
/*********************************************************************************************************
  END
*********************************************************************************************************/
