/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                嵌入式 L4 微内核操作系统
**
**                                SylixOS(TM)  MX : matrix
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: debug.c
**
** 创   建   人: Wang.Dongfang (王东方)
**
** 文件创建日期: 2018 年 03 月 02 日
**
** 描        述: Debug 相关 API 接口.
*********************************************************************************************************/
#include <Matrix.h>
#include "abi.h"
/*********************************************************************************************************
** 函数名称: MXI_debug
** 功能描述: 调试接口
** 输　入  : ucOpCode       操作码
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  MXI_debug (UINT8  ucOpCode)
{
    ULONG    ulArg0 = 0;

    ABI_CALLID_SET(&ulArg0, MX_SC_CALLID_DEBUG);
    ABI_OPCODE_SET(&ulArg0, ucOpCode);

    MX_Syscall10(ulArg0);
}
/*********************************************************************************************************
** 函数名称: MXI_debugRead
** 功能描述: 读取内核中的数据
** 输　入  : piVal      用于存放读取到的值
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
MX_SC_RESULT_T  MXI_debugRead (INT  *piVal)
{
    ULONG    ulArg0 = 0;
    ULONG    ulArg1 = 0;

    ABI_CALLID_SET(&ulArg0, MX_SC_CALLID_DEBUG);
    ABI_OPCODE_SET(&ulArg0, MX_SC_OPCODE_DEBUG_READ);

    MX_Syscall42(ulArg0, ulArg1, 0, 0, &ulArg0, piVal);

    return  (ABI_RESULT_GET(&ulArg0));
}
/*********************************************************************************************************
** 函数名称: MXI_debugWrite
** 功能描述: 写入内核中的数据
** 输　入  : iVal      写入的值
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
MX_SC_RESULT_T  MXI_debugWrite (INT  iVal)
{
    ULONG    ulArg0 = 0;
    ULONG    ulArg1 = iVal;

    ABI_CALLID_SET(&ulArg0, MX_SC_CALLID_DEBUG);
    ABI_OPCODE_SET(&ulArg0, MX_SC_OPCODE_DEBUG_WRITE);

    MX_Syscall41(ulArg0, ulArg1, 0, 0, &ulArg0);

    return  (ABI_RESULT_GET(&ulArg0));
}
/*********************************************************************************************************
  END
*********************************************************************************************************/

