/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                嵌入式 L4 微内核操作系统
**
**                                SylixOS(TM)  MX : matrix
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: abi.c
**
** 创   建   人: Cheng.Yongbin (程永斌)
**
** 文件创建日期: 2018 年 02 月 01 日
**
** 描        述: abi
*********************************************************************************************************/
#include <Matrix.h>
/*********************************************************************************************************
** 函数名称: MX_Syscall10
** 功能描述: 1 个输入参数, 输出的系统调用
** 输　入  : ulArg0     参数0
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  MX_Syscall10 (ULONG  ulArg0)
{
    /*
	__asm__ __volatile__(
        "mov    r0, %0  \n\t"
        "swi    1       \n\t"
        : "+r"(ulArg0)
        :
        : "memory"
    );
    */
}
/*********************************************************************************************************
** 函数名称: MX_Syscall41
** 功能描述: 4 个输入参数, 1 个输出结果的系统调用
** 输　入  : ulArg0     参数0
**           ulArg1     参数1
**           ulArg2     参数2
**           ulArg3     参数3
** 输　出  : pulOut1    输出0
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  MX_Syscall41 (ULONG   ulArg0,
                    ULONG   ulArg1,
                    ULONG   ulArg2,
                    ULONG   ulArg3,
                    ULONG  *pulOut0)
{
    /*
	__asm__ __volatile__(
        "mov    r0, %0  \n\t"
        "mov    r1, %1  \n\t"
        "mov    r2, %2  \n\t"
        "mov    r3, %3  \n\t"
        "swi    1       \n\t"
        "mov    %0, r0  \n\t"
        : "+r"(ulArg0), "+r"(ulArg1), "+r"(ulArg2), "+r"(ulArg3)
        :
        : "memory"
    );
    */

    *pulOut0 = ulArg0;
}
/*********************************************************************************************************
** 函数名称: MX_Syscall42
** 功能描述: 4 个输入参数, 2 个输出结果的系统调用
** 输　入  : ulArg0     参数0
**           ulArg1     参数1
**           ulArg2     参数2
**           ulArg3     参数3
** 输　出  : pulOut1    输出0
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  MX_Syscall42 (ULONG   ulArg0,
                    ULONG   ulArg1,
                    ULONG   ulArg2,
                    ULONG   ulArg3,
                    ULONG  *pulOut0,
                    ULONG  *pulOut1)
{
    /*
	__asm__ __volatile__(
        "mov    r0, %0  \n\t"
        "mov    r1, %1  \n\t"
        "mov    r2, %2  \n\t"
        "mov    r3, %3  \n\t"
        "swi    1       \n\t"
        "mov    %0, r0  \n\t"
        "mov    %1, r1  \n\t"
        : "+r"(ulArg0), "+r"(ulArg1), "+r"(ulArg2), "+r"(ulArg3)
        :
        : "memory"
    );
	*/
    *pulOut0 = ulArg0;
    *pulOut1 = ulArg1;
}
/*********************************************************************************************************
  END
*********************************************************************************************************/

