/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: bspLib.c
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2014 年 12 月 25 日
**
** 描        述: i.MX6 处理器需要为 SylixOS 提供的功能支持.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#define  __SYLIXOS_STDIO
#include "config.h"
#include "SylixOS.h"
#include "sys/compiler.h"                                               /*  编译器相关                  */
/*********************************************************************************************************
  BSP 及 驱动程序
*********************************************************************************************************/
#include "../driver/uart.h"
/*********************************************************************************************************
  Matrix 接口
*********************************************************************************************************/
UINT8  MXI_irqEnable(UINT32  uiIrqNum);
UINT8  MXI_irqDisable(UINT32  uiIrqNum);
VOID   MXI_prtnRestart(UINT32  objPrtn);
/*********************************************************************************************************
  调试信息打印
*********************************************************************************************************/
int    serial_printf(const char* str, ... );
/*********************************************************************************************************
  BSP 信息
*********************************************************************************************************/
static const CHAR   _G_pcCpuInfo[]     = "Freescale i.MX6Q (Cortex-A9 Max@1.2GHz NEON VFPv3)";
static const CHAR   _G_pcCacheInfo[]   = "64KBytes L1-Cache(D-32K/I-32K), 1MBytes L2-Cache";
static const CHAR   _G_pcPacketInfo[]  = BSP_CFG_PLATFORM_NAME;
static const CHAR   _G_pcVersionInfo[] = BSP_CFG_PLATFORM_VERSION;
/*********************************************************************************************************
  精确时间换算参数
*********************************************************************************************************/
#if 0 /* L4 */
static UINT32   _G_uiFullCnt;
static UINT64   _G_ui64NSecPerCnt7;
static UINT64   _G_ui64ComparatorCur;
#endif
/*********************************************************************************************************
** 函数名称: bspIntInit
** 功能描述: 中断系统初始化
** 输  入  : NONE
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspIntInit (VOID)
{
    //bspDebugMsg("bspIntInit()\n");
}
/*********************************************************************************************************
** 函数名称: bspIntHandle
** 功能描述: 中断入口
** 输  入  : NONE
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspIntHandle (VOID)
{
#if 0 /* L4 */
    REGISTER UINT32  uiAck = armGicIrqReadAck();
    REGISTER UINT32  uiSourceCpu = (uiAck >> 10) & 0x7;
    REGISTER UINT32  uiVector    = uiAck & 0x1FF;

    archIntHandle((ULONG)uiVector, LW_TRUE);

    armGicIrqWriteDone(uiAck);
#endif
    bspDebugMsg("-----bspIntHandle()-----\n"); while (1);
}
/*********************************************************************************************************
** 函数名称: bspIntVectorEnable
** 功能描述: 使能指定的中断向量
** 输  入  : ulVector     中断向量
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspIntVectorEnable (ULONG  ulVector)
{
    //armGicIntVecterEnable(ulVector, LW_FALSE, ARM_DEFAULT_INT_PRIORITY, 1 << 0);
    //serial_printf("-----bspIntVectorEnable(%d)-----\n", ulVector); /*while (1);*/
    MXI_irqEnable(ulVector);                                            /*  Matrix 提供的 API           */
}
/*********************************************************************************************************
** 函数名称: bspIntVectorDisable
** 功能描述: 禁能指定的中断向量
** 输  入  : ulVector     中断向量
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspIntVectorDisable (ULONG  ulVector)
{
    //armGicIntVecterDisable(ulVector);
    //bspDebugMsg("-----bspIntVectorDisable()-----\n"); while (1);
    //serial_printf("-----bspIntVectorDisable(%d)-----\n", ulVector); /*while (1);*/
    //MXI_irqDisable(ulVector);                                           /*  Matrix 提供的 API           */
    /* 在 Reboot 时有可能将其他分区的硬件中断也关掉 */
}
/*********************************************************************************************************
** 函数名称: bspIntVectorIsEnable
** 功能描述: 检查指定的中断向量是否使能
** 输  入  : ulVector     中断向量
** 输  出  : LW_FALSE 或 LW_TRUE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
BOOL  bspIntVectorIsEnable (ULONG  ulVector)
{
    //return  (armGicIrqIsEnable(ulVector) ? LW_TRUE : LW_FALSE);
    //bspDebugMsg("-----bspIntVectorIsEnable()-----\n"); /*while (1);*/
    return  (LW_TRUE);
}
/*********************************************************************************************************
** 函数名称: bspIntVectorSetPriority
** 功能描述: 设置指定的中断向量的优先级
** 输  入  : ulVector     中断向量号
**           uiPrio       优先级
** 输　出  : ERROR CODE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
#if LW_CFG_INTER_PRIO > 0

ULONG   bspIntVectorSetPriority (ULONG  ulVector, UINT  uiPrio)
{
    return  (ERROR_NONE);
}
/*********************************************************************************************************
** 函数名称: bspIntVectorGetPriority
** 功能描述: 获取指定的中断向量的优先级
** 输  入  : ulVector     中断向量号
**           puiPrio      优先级
** 输　出  : ERROR CODE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
ULONG   bspIntVectorGetPriority (ULONG  ulVector, UINT  *puiPrio)
{
    *puiPrio = 0;
    return  (ERROR_NONE);
}

#endif                                                                  /*  LW_CFG_INTER_PRIO > 0       */
/*********************************************************************************************************
** 函数名称: bspIntVectorSetTarget
** 功能描述: 设置指定的中断向量的目标 CPU
** 输　入  : ulVector      中断向量号
**           stSize        CPU 掩码集内存大小
**           pcpuset       CPU 掩码
** 输　出  : ERROR CODE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
#if LW_CFG_INTER_TARGET > 0

ULONG   bspIntVectorSetTarget (ULONG  ulVector, size_t  stSize, const PLW_CLASS_CPUSET  pcpuset)
{
#if 0 /* L4 */
    UINT    i;

    stSize *= 8;
    stSize  = min(stSize, sizeof(UINT32) * 8);

    for (i = 0; i < stSize; i++) {
        if (LW_CPU_ISSET(i, pcpuset)) {
            armGicIntVecterEnable(ulVector, LW_FALSE, ARM_DEFAULT_INT_PRIORITY, 1UL << i);
            break;
        }
    }
#endif
    bspDebugMsg("-----bspIntVectorSetTarget()-----\n"); while (1);

    return  (ERROR_NONE);
}
/*********************************************************************************************************
** 函数名称: bspIntVectorGetTarget
** 功能描述: 获取指定的中断向量的目标 CPU
** 输　入  : ulVector      中断向量号
**           stSize        CPU 掩码集内存大小
**           pcpuset       CPU 掩码
** 输　出  : ERROR CODE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
ULONG   bspIntVectorGetTarget (ULONG  ulVector, size_t  stSize, PLW_CLASS_CPUSET  pcpuset)
{
#if 0 /* L4 */
    UINT  uiCpuId;

    armGicIrqTargetGet(ulVector, &uiCpuId);

    if (uiCpuId < (stSize * 8)) {
        uiCpuId = 0;
    }

    LW_CPU_SET(uiCpuId, pcpuset);
#endif
    bspDebugMsg("-----bspIntVectorGetTarget()-----\n"); while (1);

    return  (ERROR_NONE);
}

#endif                                                                  /*  LW_CFG_INTER_TARGET > 0     */
/*********************************************************************************************************
  BSP 信息
*********************************************************************************************************/
/*********************************************************************************************************
** 函数名称: bspInfoCpu
** 功能描述: BSP CPU 信息
** 输　入  : NONE
** 输　出  : CPU 信息
** 全局变量:
** 调用模块:
*********************************************************************************************************/
CPCHAR  bspInfoCpu (VOID)
{
    return  (_G_pcCpuInfo);
}
/*********************************************************************************************************
** 函数名称: bspInfoCache
** 功能描述: BSP CACHE 信息
** 输　入  : NONE
** 输　出  : CACHE 信息
** 全局变量:
** 调用模块:
*********************************************************************************************************/
CPCHAR  bspInfoCache (VOID)
{
    return  (_G_pcCacheInfo);
}
/*********************************************************************************************************
** 函数名称: bspInfoPacket
** 功能描述: BSP PACKET 信息
** 输　入  : NONE
** 输　出  : PACKET 信息
** 全局变量:
** 调用模块:
*********************************************************************************************************/
CPCHAR  bspInfoPacket (VOID)
{
    return  (_G_pcPacketInfo);
}
/*********************************************************************************************************
** 函数名称: bspInfoVersion
** 功能描述: BSP VERSION 信息
** 输　入  : NONE
** 输　出  : BSP VERSION 信息
** 全局变量:
** 调用模块:
*********************************************************************************************************/
CPCHAR  bspInfoVersion (VOID)
{
    return  (_G_pcVersionInfo);
}
/*********************************************************************************************************
** 函数名称: bspInfoHwcap
** 功能描述: BSP 硬件特性
** 输　入  : NONE
** 输　出  : 硬件特性 (如果支持硬浮点, 可以加入 HWCAP_VFP , HWCAP_VFPv3 , HWCAP_VFPv3D16 , HWCAP_NEON)
** 全局变量:
** 调用模块:
*********************************************************************************************************/
ULONG  bspInfoHwcap (VOID)
{
    //return  (HWCAP_VFP | HWCAP_VFPv3 | HWCAP_NEON);
    return  (0);
}
/*********************************************************************************************************
** 函数名称: bspInfoRomBase
** 功能描述: BSP ROM 基地址
** 输　入  : NONE
** 输　出  : ROM 基地址
** 全局变量:
** 调用模块:
*********************************************************************************************************/
addr_t bspInfoRomBase (VOID)
{
    return  (BSP_CFG_ROM_BASE);
}
/*********************************************************************************************************
** 函数名称: bspInfoRomSize
** 功能描述: BSP ROM 大小
** 输　入  : NONE
** 输　出  : ROM 大小
** 全局变量:
** 调用模块:
*********************************************************************************************************/
size_t bspInfoRomSize (VOID)
{
    return  (BSP_CFG_ROM_SIZE);
}
/*********************************************************************************************************
** 函数名称: bspInfoRamBase
** 功能描述: BSP RAM 基地址
** 输　入  : NONE
** 输　出  : RAM 基地址
** 全局变量:
** 调用模块:
*********************************************************************************************************/
addr_t bspInfoRamBase (VOID)
{
    return  (BSP_CFG_RAM_BASE);
}
/*********************************************************************************************************
** 函数名称: bspInfoRamSize
** 功能描述: BSP RAM 大小
** 输　入  : NONE
** 输　出  : RAM 大小
** 全局变量:
** 调用模块:
*********************************************************************************************************/
size_t bspInfoRamSize (VOID)
{
    return  (BSP_CFG_RAM_SIZE);
}
/*********************************************************************************************************
  BSP HOOK
*********************************************************************************************************/
/*********************************************************************************************************
** 函数名称: bspTaskCreateHook
** 功能描述: 任务创建 hook
** 输  入  : ulId     任务 ID
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspTaskCreateHook (LW_OBJECT_ID  ulId)
{
    (VOID)ulId;
}
/*********************************************************************************************************
** 函数名称: bspTaskDeleteHook
** 功能描述: 任务删除 hook
** 输  入  : ulId         任务 ID
**           pvReturnVal  返回值
**           ptcb         任务控制块
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspTaskDeleteHook (LW_OBJECT_ID  ulId, PVOID  pvReturnVal, PLW_CLASS_TCB  ptcb)
{
    (VOID)ulId;
    (VOID)pvReturnVal;
    (VOID)ptcb;
}
/*********************************************************************************************************
** 函数名称: bspTaskSwapHook
** 功能描述: 任务切换 hook
** 输  入  : hOldThread       被换出的任务
**           hNewThread       要运行的任务
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspTaskSwapHook (LW_OBJECT_HANDLE   hOldThread, LW_OBJECT_HANDLE   hNewThread)
{
    (VOID)hOldThread;
    (VOID)hNewThread;
}
/*********************************************************************************************************
** 函数名称: bspTaskIdleHook
** 功能描述: idle 任务调用此函数
** 输  入  : NONE
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspTaskIdleHook (VOID)
{
}
/*********************************************************************************************************
** 函数名称: bspTaskIdleHook
** 功能描述: 每个操作系统时钟节拍，系统将调用这个函数
** 输  入  : i64Tick      系统当前时钟
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspTickHook (INT64   i64Tick)
{
    //_G_ui64ComparatorCur = armGlobalTimerComparatorGet() - _G_uiFullCnt;
}
/*********************************************************************************************************
** 函数名称: bspWdTimerHook
** 功能描述: 看门狗定时器到时间时都会调用这个函数
** 输  入  : ulId     任务 ID
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspWdTimerHook (LW_OBJECT_ID  ulId)
{
    (VOID)ulId;
}
/*********************************************************************************************************
** 函数名称: bspTCBInitHook
** 功能描述: 初始化 TCB 时会调用这个函数
** 输  入  : ulId     任务 ID
**           ptcb     任务控制块
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspTCBInitHook (LW_OBJECT_ID  ulId, PLW_CLASS_TCB   ptcb)
{
    (VOID)ulId;
    (VOID)ptcb;
}
/*********************************************************************************************************
** 函数名称: bspKernelInitHook
** 功能描述: 系统初始化完成时会调用这个函数
** 输  入  : NONE
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspKernelInitHook (VOID)
{
}
/*********************************************************************************************************
** 函数名称: bspReboot
** 功能描述: 系统重新启动
** 输　入  : iRebootType       重启类型
**           ulStartAddress    启动开始地址
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspReboot (INT  iRebootType, addr_t  ulStartAddress)
{
    //writew(0x0020 | 0x0010 | 0x0002 | 0x0004, WDOG1_BASE_ADDR);         /*  使用看门狗实现复位          */
    bspDebugMsg("bspReboot()\n");
    MXI_prtnRestart(0);

    while (1);
}
/*********************************************************************************************************
** 函数名称: bspDebugMsg
** 功能描述: 打印系统调试信息
** 输　入  : pcMsg     信息
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspDebugMsg (CPCHAR  pcMsg)
{
    if (!pcMsg) {                                                       /*  指针为空                    */
        return;
    }

    while (*pcMsg != '\0') {                                            /*  发送字符串                  */
        imx6qPutChar(0, pcMsg);
        //uart_putc(*pcMsg);
        pcMsg++;
    }
}
/*********************************************************************************************************
  CACHE 相关接口
*********************************************************************************************************/
/*********************************************************************************************************
** 函数名称: bspL2CBase
** 功能描述: 获得 L2 控制器基地址
** 输  入  : pulBase      返回的基地址
** 输  出  : -1 表示不启用 L2
** 全局变量:
** 调用模块:
*********************************************************************************************************/
INT  bspL2CBase (addr_t  *pulBase)
{
    *pulBase = 0xA02000;

    return  (ERROR_NONE);
}
/*********************************************************************************************************
** 函数名称: bspL2CAux
** 功能描述: 获得 L2 控制器 Aux 控制掩码
** 输  入  : puiAuxVal      Aux 寄存器值
**           puiAuxMask     Aux 控制掩码
** 输  出  : -1 表示不启用 L2
** 全局变量:
** 调用模块:
*********************************************************************************************************/
INT  bspL2CAux (UINT32  *puiAuxVal, UINT32  *puiAuxMask)
{
    *puiAuxVal  =  0u;
    *puiAuxMask = ~0u;

    return  (ERROR_NONE);
}
/*********************************************************************************************************
  MMU 相关接口
*********************************************************************************************************/
/*********************************************************************************************************
** 函数名称: bspMmuPgdMaxNum
** 功能描述: 获得 PGD 池的数量
** 输  入  : NONE
** 输  出  : PGD 池的数量 (1 个池可映射 4GB 空间, 推荐返回 1)
** 全局变量:
** 调用模块:
*********************************************************************************************************/
ULONG  bspMmuPgdMaxNum (VOID)
{
    return  (1);
}
/*********************************************************************************************************
** 函数名称: bspMmuPgdMaxNum
** 功能描述: 获得 PTE 池的数量
** 输  入  : NONE
** 输  出  : PTE 池的数量 (映射 4GB 空间, 需要 4096 个 PTE 池)
** 全局变量:
** 调用模块:
*********************************************************************************************************/
ULONG  bspMmuPteMaxNum (VOID)
{
    return  (4096);
}
/*********************************************************************************************************
  操作系统多核接口
*********************************************************************************************************/
/*********************************************************************************************************
** 函数名称: bspMpInt
** 功能描述: 产生一个核间中断
** 输  入  : ulCPUId      目标 CPU
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID   bspMpInt (ULONG  ulCPUId)
{
    //armGicSoftwareIntSend(ARM_SW_INT_VECTOR(ulCPUId), GIC_SW_INT_OPTION_USE_TARGET_LIST, 1 << ulCPUId);
}
#if 0 /* L4 */
/*********************************************************************************************************
  SMP 同步变量
*********************************************************************************************************/
#define BSP_HOLDING_PEN_START    0xdeadbeef                             /*  启动从核的模数              */

static volatile ULONG            _G_ulHoldingPen[LW_CFG_MAX_PROCESSORS];
/*********************************************************************************************************
** 函数名称: bspCpuUpSyncPoint1
** 功能描述: SMP 启动同步点 1
** 输  入  : pvArg        参数
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
static INT  bspCpuUpSyncPoint1 (PVOID  pvArg)
{
    API_CacheClear(DATA_CACHE, 0, (size_t)~0);

    return  (ERROR_NONE);
}
/*********************************************************************************************************
** 函数名称: bspCpuUpSyncPoint2
** 功能描述: SMP 启动同步点 2
** 输  入  : pvArg        参数
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
static VOID  bspCpuUpSyncPoint2 (PVOID  pvArg)
{
    ULONG  ulCPUId = (ULONG)pvArg;

    KN_SMP_MB();
    while (_G_ulHoldingPen[ulCPUId] != BSP_HOLDING_PEN_START) {
        ;
    }
}
#endif
/*********************************************************************************************************
** 函数名称: bspCpuUpDone
** 功能描述: 通知其它 CPU 本核心启动完成
** 输  入  : NONE
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspCpuUpDone (VOID)
{
#if 0 /* L4 */
    ULONG  ulCPUId = archMpCur();
    INT    i;

    KN_SMP_MB();
    _G_ulHoldingPen[ulCPUId] = BSP_HOLDING_PEN_START;
    KN_SMP_MB();

    if (ulCPUId != 0) {                                                 /*  主核继续启动其他核          */

__WAIT_CPU:
        for (i = 1; i < LW_NCPUS; i++) {                                /*  等待其他核心启动完毕        */
            if (_G_ulHoldingPen[i] != BSP_HOLDING_PEN_START) {
                goto __WAIT_CPU;
            }
        }
    }

    API_CacheClear(DATA_CACHE, 0, (size_t)~0);
#endif
}
/*********************************************************************************************************
** 函数名称: bspCpuUp
** 功能描述: 启动一个 CPU
** 输  入  : ulCPUId      目标 CPU
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID   bspCpuUp (ULONG  ulCPUId)
{
#if 0 /* L4 */
    INTREG  iregInterLevel;

    iregInterLevel = KN_INT_DISABLE();

    _G_ulHoldingPen[ulCPUId] = 0;
    KN_SMP_MB();

    bspCpuUpSyncPoint1((PVOID)ulCPUId);

    imx6qCpuStart2nd(ulCPUId);

    bspCpuUpSyncPoint2((PVOID)ulCPUId);

    KN_INT_ENABLE(iregInterLevel);
#endif
}
/*********************************************************************************************************
** 函数名称: bspCpuDown
** 功能描述: 停止一个 CPU
** 输  入  : ulCPUId      目标 CPU
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID   bspCpuDown (ULONG  ulCPUId)
{
    //imx6qCpuDisable(ulCPUId);
}
/*********************************************************************************************************
  操作系统 CPU 速度控制接口
*********************************************************************************************************/
/*********************************************************************************************************
** 函数名称: bspSuspend
** 功能描述: 系统进入休眠状态
** 输  入  : NONE
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID    bspSuspend (VOID)
{
    //imx6qCcmLowPower(WAIT_MODE);
}
/*********************************************************************************************************
** 函数名称: bspCpuPowerSet
** 功能描述: CPU 设置运行速度
** 输  入  : uiPowerLevel     运行速度级别
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID    bspCpuPowerSet (UINT  uiPowerLevel)
{
}
/*********************************************************************************************************
** 函数名称: bspCpuPowerGet
** 功能描述: CPU 获取运行速度
** 输  入  : puiPowerLevel    运行速度级别
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID    bspCpuPowerGet (UINT  *puiPowerLevel)
{
    if (puiPowerLevel) {
        *puiPowerLevel = LW_CPU_POWERLEVEL_TOP;
    }
}
/*********************************************************************************************************
** 函数名称: __tickTimerIsr
** 功能描述: tick 定时器中断服务例程
** 输  入  : NONE
** 输  出  : 中断返回值
** 全局变量:
** 调用模块:
*********************************************************************************************************/
/*static*/ irqreturn_t  __tickTimerIsr (VOID)
{
    //armGlobalTimerIntClear();                                           /*  清除中断                    */

    API_KernelTicksContext();                                           /*  保存被时钟中断的线程控制块  */

    API_KernelTicks();                                                  /*  内核 TICKS 通知             */
    API_TimerHTicks();                                                  /*  高速 TIMER TICKS 通知       */

    return  (LW_IRQ_HANDLED);
}
/*********************************************************************************************************
** 函数名称: bspTickInit
** 功能描述: 初始化 tick 时钟
** 输  入  : NONE
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspTickInit (VOID)
{
#if 0 /* L4 */
    REGISTER UINT32      uiIncrementValue, uiPrescaler;

#if TICK_IN_THREAD > 0
    LW_CLASS_THREADATTR  threakattr;

    API_ThreadAttrBuild(&threakattr, (8 * LW_CFG_KB_SIZE),
                        LW_PRIO_T_TICK,
                        LW_OPTION_THREAD_STK_CHK |
                        LW_OPTION_THREAD_UNSELECT |
                        LW_OPTION_OBJECT_GLOBAL |
                        LW_OPTION_THREAD_SAFE, LW_NULL);

    htKernelTicks = API_ThreadCreate("t_tick", (PTHREAD_START_ROUTINE)__tickThread,
                                     &threakattr, LW_NULL);
#endif                                                                  /*  TICK_IN_THREAD > 0          */

    /*
     *                          (PRESCALER_value+1) x (Load_value+1) x 2
     * The timer interval = ---------------------------------------------
     *                                          PERIPHCLK
     */
    uiIncrementValue = ((imx6qMainClkGet(CPU_CLK) / 2) / LW_TICK_HZ);
    uiPrescaler      = 0;

    _G_uiFullCnt       = uiIncrementValue;
    _G_ui64NSecPerCnt7 = ((1000 * 1000 * 1000 / LW_TICK_HZ) << 7) / _G_uiFullCnt;

    armGlobalTimerInit(LW_TRUE, uiIncrementValue, uiPrescaler, LW_TRUE);

    armGlobalTimerCounterSet(0);

    armGlobalTimerComparatorSet(uiIncrementValue);
    _G_ui64ComparatorCur = 0;
#endif

    API_InterVectorConnect(ARM_TICK_INT_VECTOR,
                           (PINT_SVR_ROUTINE)__tickTimerIsr,
                           LW_NULL,
                           "tick_isr");

    //API_InterVectorEnable(ARM_TICK_INT_VECTOR);

#if 0 /* L4 */
    armGicIrqPrioritySet(ARM_TICK_INT_VECTOR, ARM_TICK_INT_PRIORITY);

    armGlobalTimerStart();
#endif
}
/*********************************************************************************************************
** 函数名称: bspTickHighResolution
** 功能描述: 修正从最近一次 tick 到当前的精确时间.
** 输　入  : ptv       需要修正的时间
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  bspTickHighResolution (struct timespec *ptv)
{
#if 0 /* L4 */
    UINT64  ui64CntCur = (UINT64)armGlobalTimerCounterGet();

    ptv->tv_nsec += ((ui64CntCur - _G_ui64ComparatorCur) * _G_ui64NSecPerCnt7) >> 7;
    if (ptv->tv_nsec >= 1000000000) {
        ptv->tv_nsec -= 1000000000;
        ptv->tv_sec++;
    }
#endif
}
/*********************************************************************************************************
** 函数名称: bspDelayUs
** 功能描述: 延迟微秒
** 输  入  : ulUs     微秒数
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID bspDelayUs (ULONG  ulUs)
{
    volatile UINT  i;

    while (ulUs) {
        ulUs--;
        for (i = 0; i < 600; i++) {
        }
    }
}
/*********************************************************************************************************
** 函数名称: bspDelayNs
** 功能描述: 延迟纳秒
** 输  入  : ulNs     纳秒数
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID    bspDelayNs (ULONG  ulNs)
{
    volatile UINT  i;

    while (ulNs) {
        ulNs = (ulNs < 100) ? (0) : (ulNs - 100);
        for (i = 0; i < 40; i++) {
        }
    }
}
/*********************************************************************************************************
  semihosting
*********************************************************************************************************/
#define import(__use_no_semihosting_swi)

void  _ttywrch (int  ch)
{
    bspDebugMsg("__use_no_semihosting_swi _ttywrch()!\n");
    while (1);
}

void  _sys_exit (int  return_code)
{
    bspDebugMsg("__use_no_semihosting_swi _sys_exit()!\n");
    while (1);
}
/*********************************************************************************************************
  GCC
*********************************************************************************************************/
#ifdef __GNUC__
int  __aeabi_read_tp (void)
{
    return  (0);
}
#endif                                                                  /*  __GNUC__                    */
/*********************************************************************************************************
  END
*********************************************************************************************************/

