/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: imx6q_sylixos.h
**
** 创   建   人: acoinfo (翼辉)
**
** 文件创建日期: 2016年2月23日
**
** 描        述: 适配 SylixOS 官方开发板的 BSP 文件头文件
*********************************************************************************************************/
#ifndef L4IMX6Q_SYLIXOS_H_
#define L4IMX6Q_SYLIXOS_H_
/*********************************************************************************************************
  CPU 相关通用配置
*********************************************************************************************************/
#define ARM_TICK_INT_VECTOR                 27                          /*  TICK 中断 ID                */
/*********************************************************************************************************
  名字配置
*********************************************************************************************************/
#define BSP_CFG_PLATFORM_NAME               "APP SylixOS GuestOS"
#define BSP_CFG_PLATFORM_VERSION            "BSP version 1.0.1"
/*********************************************************************************************************
  ROM RAM 相关配置
  Warning: virtual address is same with physical address in DMA area.
*********************************************************************************************************/
#define BSP_CFG_ROM_BASE                    0x00000000
#define BSP_CFG_ROM_SIZE                    (0)

#define BSP_CFG_RAM_BASE                    (0x12000000)
#define BSP_CFG_RAM_SIZE                    (256 * 1024 * 1024)

#define BSP_CFG_TEXT_SIZE                   (6   * 1024 * 1024)
#define BSP_CFG_DATA_SIZE                   (64  * 1024 * 1024)
#define BSP_CFG_DMA_SIZE                    (128 * 1024 * 1024)
#define BSP_CFG_RAM_RSV_SIZE                (8   * LW_CFG_MB_SIZE)
#define BSP_CFG_APP_SIZE                    (BSP_CFG_RAM_SIZE - BSP_CFG_TEXT_SIZE \
                                                              - BSP_CFG_DATA_SIZE \
                                                              - BSP_CFG_DMA_SIZE \
                                                              - BSP_CFG_RAM_RSV_SIZE)

#define BSP_CFG_RAM_RSV_ADDR                (BSP_CFG_RAM_BASE + BSP_CFG_TEXT_SIZE \
                                                              + BSP_CFG_DATA_SIZE \
                                                              + BSP_CFG_DMA_SIZE)
/*********************************************************************************************************
  虚拟内存空间 相关配置
  Physical:
  +----------------------------------------------------+
  |  TEXT  |  DATA   |   DMA   |  RSV  |      APP      |
  +----------------------------------------------------+
  Virtual:                             |                                            4GB
  ------------------------------------------------------------------------------------
  |                                    |      VAPP     |  VIO 64MB   |
  ------------------------------------------------------------------------------------
  Warning:
      1. DMA should NOT overlap with VAPP.
      2. VAPP should NOT overlap with VIO.
*********************************************************************************************************/
#define BSP_CFG_VAPP_START                  (BSP_CFG_RAM_BASE + BSP_CFG_TEXT_SIZE   \
                                                              + BSP_CFG_DATA_SIZE   \
                                                              + BSP_CFG_DMA_SIZE    \
                                                              + BSP_CFG_RAM_RSV_SIZE)
#define BSP_CFG_VAPP_SIZE                   (BSP_CFG_APP_SIZE)

#if 0
#define BSP_CFG_VIO_START                   0x50001000
#define BSP_CFG_VIO_SIZE                    (64  * LW_CFG_MB_SIZE)
#endif

/*********************************************************************************************************
  目标电路板使用相关宏定义
*********************************************************************************************************/
#define BSP_DBG_MSG_PORT                    1                           /* DebugMsg 函数使用的串口      */
#define BSP_CFG_COM_SHELL                   0                           /* shell 使用的串口编号         */
#define BSP_CFG_STD_FILE                    "/dev/ttyS0"                /* shell 使用的串口设备名       */

#endif                                                                  /* L4IMX6Q_SYLIXOS_H_           */
/*********************************************************************************************************
  END
*********************************************************************************************************/
