/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                嵌入式 L4 微内核操作系统
**
**                                SylixOS(TM)  MX : matrix
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: main.c
**
** 创   建   人: Wang.Dongfang (王东方)
**
** 文件创建日期: 2018 年 02 月 28 日
**
** 描        述: 应用进程.
*********************************************************************************************************/
#include <Matrix.h>
#include <libc.h>
#include <api.h>
/*********************************************************************************************************
  常量
*********************************************************************************************************/
#define IRQ_NUM_TICK    27                                              /*  Tick 中断号                 */
#define SWI_NUM_SCHD    7                                               /*  Sched 系统调用号            */
/*********************************************************************************************************
  函数声明
*********************************************************************************************************/
VOID        _isr(UINT32  uiIrqNum, PARCH_USER_CTX  puctxSP);
VOID        _swi(UINT32  uiSwiNum, PARCH_USER_CTX  puctxSP);
VOID        delayMs(ULONG  ulMs);
extern int  DfewOSMain();                                               /*  DfewOS 入口函数             */
extern void L4_OSTaskSwitch(int *puctx);                                /*  DfewOS 上下文切换           */
extern int  L4_OSIntEntry(int  iVec, int  *puctx);                      /*  DfewOS 中断处理             */
/*********************************************************************************************************
** 函数名称: l_main
** 功能描述: 用户进程第一个 C 函数
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  l_main (VOID)
{
#if 0
    extern int  __bss_start, __bss_end;
    int         *p;

    serial_printf("__bss_start: %X\n", &__bss_start);
    serial_printf("  __bss_end: %X\n", &__bss_end);
    for (p = &__bss_start; p < &__bss_end; p++) {
        //uart_putc('.');
        *p = 0;
    }
    serial_printf("bss section clean.\n");
#endif

#if 0
    while (1) {
        if (getCpsr() & 0x80) {
            (*(volatile int *)(0x02020040)) = '2';
        } else {
            (*(volatile int *)(0x02020040)) = '1';
        }
    }
#endif

    lib_printf("---------This is DfewOS---------\n");
    MXI_irqRegister(_isr);
    MXI_irqAttach(IRQ_NUM_TICK);
    MXI_swiRegister(SWI_NUM_SCHD, _swi);

    DfewOSMain();

    while (1);
}
/*********************************************************************************************************
** 函数名称: delayMs
** 功能描述: 延迟毫秒
** 输  入  : ulMs     毫秒数
** 输  出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
VOID  delayMs (ULONG  ulMs)
{
    volatile UINT  i;

    while (ulMs) {
        ulMs--;
        for (i = 0; i < 8065; i++) {
        }
    }
}
/*********************************************************************************************************
** 函数名称: _isr
** 功能描述: 中断回调函数
** 输　入  : uiIrqNum       中断号
**           puctxSP        用户上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  _isr (UINT32  uiIrqNum, PARCH_USER_CTX  puctxSP)
{
#if 0
    //uart_putc('.');
    switch (uiIrqNum) {

    case IRQ_NUM_TICK:
        L4_OSTimerHandler();
        L4_OSTaskSwitch((int *)puctxSP);
        break;

    default:
        break;
    }
#endif
    L4_OSIntEntry(uiIrqNum, (int *)puctxSP);
}
/*********************************************************************************************************
** 函数名称: _swi
** 功能描述: 系统调用回调函数
** 输　入  : uiSwiNum       系统调用号
**           puctxSP        用户上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  _swi (UINT32  uiSwiNum, PARCH_USER_CTX  puctxSP)
{
    L4_OSTaskSwitch((int *)puctxSP);
}
/*********************************************************************************************************
  END
*********************************************************************************************************/

