/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                嵌入式 L4 微内核操作系统
**
**                                SylixOS(TM)  MX : matrix
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: init.c
**
** 创   建   人: Li.Jing (李靖)
**
** 文件创建日期: 2017 年 12 月 19 日
**
** 描        述: 微内核初始化流程.
*********************************************************************************************************/
#define __GLOBAL_VAR_FILE                                               /*  全局变量定义文件            */
#include <Matrix.h>
/*********************************************************************************************************
** 函数名称: __initParam
** 功能描述: 解析启动参数
** 输　入  : pcParam       启动参数, 是以空格分开的一个字符串列表，通常具有如下形式:
**                         ncpus=1          CPU 个数
**                         tick=100         系统 tick 频率, 默认为 100 (推荐 100 ~ 10000 中间)
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  __initParam (CPCHAR  pcParam)
{
    _K_ulNCpus = 4;
}
/*********************************************************************************************************
** 函数名称: __initModule
** 功能描述: 子模块初始化
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  __initModule (VOID)
{
    kobjInit();                                                         /*  内核对象初始化              */
    heapInit();                                                         /*  内核堆栈初始化              */
    prtnInit();                                                         /*  用户进程初始化              */
    schedInit();                                                        /*  调度器初始化                */

    //testInit();                                                       /*  测试线程初始化              */
}
/*********************************************************************************************************
** 函数名称: initMatrix
** 功能描述: 微内核入口函数
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: BSP 模块的初始化函数
*********************************************************************************************************/
VOID  initMatrix (CPCHAR  pcParam)
{
    INT      i;

    archMmuInit("A9");

    __initParam(pcParam);                                               /*  解析启动参数                */
    __initModule();                                                     /*  子模块初始化                */

    schedActiveCpu(MX_CPU_GET_CUR());                                   /*  更新主核候选表, 当前线程    */

    for (i = 1; i < MX_NCPUS; i++) {
        bspCpuUp(i);                                                    /*  激活从核, 并等其初始化完成  */
    }

    archVcpuCtxStart(MX_CPU_GET_CUR());                                 /*  加载当前线程                */

    bspDebugMsg("Never be here!");
}
/*********************************************************************************************************
** 函数名称: initSmpMatrix
** 功能描述: 从核启动后微内核入口函数
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  initSmpMatrix (VOID)
{
    schedActiveCpu(MX_CPU_GET_CUR());                                   /*  更新从核候选表              */

    archVcpuCtxStart(MX_CPU_GET_CUR());                                 /*  加载当前线程                */

    bspDebugMsg("Never be here!");
}
/*********************************************************************************************************
  END
*********************************************************************************************************/

