/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                嵌入式 L4 微内核操作系统
**
**                                SylixOS(TM)  MX : matrix
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: main.c
**
** 创   建   人: Wang.Dongfang (王东方)
**
** 文件创建日期: 2018 年 02 月 28 日
**
** 描        述: 应用进程.
*********************************************************************************************************/
#include <Matrix.h>
#include <libc.h>
#include <api.h>
/*********************************************************************************************************
  常量
*********************************************************************************************************/
#define IRQ_NUM_TICK    27                                              /*  Tick 中断号                 */
#define IRQ_NUM_SD3     57                                              /*  SD 卡中断号                 */
#define IRQ_NUM_SD2     56                                              /*  SD 卡中断号                 */
#define IRQ_NUM_ENET    150                                             /*  网卡中断号                  */
#define IRQ_NUM_UART0   58                                              /*  串口 0 中断号               */
#define IRQ_NUM_UART3   61                                              /*  串口 3 中断号               */
#define SWI_NUM_SCHD    7                                               /*  Sched 系统调用号            */
/*********************************************************************************************************
  函数声明
*********************************************************************************************************/
VOID        _isr(UINT32  uiIrqNum, PARCH_USER_CTX  puctxSP);
VOID        _swi(UINT32  uiSwiNum, PARCH_USER_CTX  puctxSP);
extern int  halPrimaryCpuMain(VOID);                                    /*  SylixOS 入口函数            */
extern void L4_OSTaskSwitch(int  *puctx);                               /*  SylixOS 上下文切换          */
extern int  L4_OSIntEntry(int  iVec, int  *puctx);                      /*  SylixOS 中断入口            */
/*********************************************************************************************************
** 函数名称: l_main
** 功能描述: 用户进程第一个 C 函数
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  l_main (VOID)
{
    lib_printf("---------This is SylixOS---------\n");
    MXI_irqRegister(_isr);
    MXI_irqAttach(IRQ_NUM_TICK);
    MXI_irqAttach(IRQ_NUM_UART0);
    //MXI_irqAttach(IRQ_NUM_UART3);
    //MXI_irqAttach(IRQ_NUM_SD3);
    //MXI_irqAttach(IRQ_NUM_SD2);
    //MXI_irqAttach(IRQ_NUM_ENET);
    MXI_swiRegister(SWI_NUM_SCHD, _swi);

    halPrimaryCpuMain();

    while (1);
}
/*********************************************************************************************************
** 函数名称: _isr
** 功能描述: 中断回调函数
** 输　入  : uiIrqNum       中断号
**           puctxSP        用户上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  _isr (UINT32  uiIrqNum, PARCH_USER_CTX  puctxSP)
{
    L4_OSIntEntry(uiIrqNum, (int *)puctxSP);
}
/*********************************************************************************************************
** 函数名称: _swi
** 功能描述: 系统调用回调函数
** 输　入  : uiSwiNum       系统调用号
**           puctxSP        用户上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  _swi (UINT32  uiSwiNum, PARCH_USER_CTX  puctxSP)
{
    L4_OSTaskSwitch((int *)puctxSP);
}
/*********************************************************************************************************
  END
*********************************************************************************************************/

